In [2]:
import pandas as pd
import numpy as np

#### Pandas

In [20]:
labels = ["a","b","c"]

In [8]:
minha_lista = [10,20,30]
arr = np.array([10,20,30])
d =  {'a':10,'b':20,'c':30}

In [21]:
pd.Series(d,index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr,name="lista1")

0    10
1    20
2    30
Name: lista1, dtype: int64

In [9]:
GO = pd.Series([1,2,3,4],index=['A','B','C','d'])

In [10]:
go  = pd.Series([1,2,3,4],index=['A','e','C','d'])
go-GO*GO/go

A    0.0
B    NaN
C    0.0
d    0.0
e    NaN
dtype: float64

In [15]:
pd.DataFrame([[go],[GO]])

                                          0
0  A    1
e    2
C    3
d    4
dtype: int64
1  A    1
B    2
C    3
d    4
dtype: int64

#### DataFrame

In [144]:
np.random.seed(101)

In [145]:
    df = pd.DataFrame(np.random.randn(5,4),index="A B C D E".split(),columns="W X Y Z".split())

In [67]:
type(df[['W','Y']])

pandas.core.frame.DataFrame

In [68]:
df.W

A    1.606780
B    0.041460
C   -0.804652
D   -1.080471
E    0.975720
Name: W, dtype: float64

In [72]:
## add a new column
df["new"] = df.W + df.X
df

          W         X         Y         Z       new
A  1.606780 -1.115710 -1.385379 -1.329660  0.491070
B  0.041460 -0.411055 -0.771329  0.110477 -0.369595
C -0.804652  0.253548  0.649148  0.358941 -0.551103
D -1.080471  0.902398  0.161781  0.833029 -0.178074
E  0.975720 -0.388239  0.783316 -0.708954  0.587481

In [80]:
    df.drop("new",axis=1,inplace=True)

In [99]:
df.loc[["A"],["Z"]]
df.loc["A"]["Z"]

-1.3296600588247933

In [118]:
df.iloc[1:4,1:]
df.iloc[1:3]

         W         X         Y         Z
B  0.04146 -0.411055 -0.771329  0.110477

In [139]:
df[df["W"]>0.2]

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
D  0.305632  0.243178  0.864165 -1.560931

In [141]:
df[df["W"]>0.2]["Y"]

A    0.677535
D    0.864165
Name: Y, dtype: float64

In [153]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [157]:
df[(df["W"]>1) & (df["Y"]>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [160]:
df[(df["W"]>1) | (df["Y"]>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [162]:
df.reset_index(inplace=True)

In [3]:
col = "SP,RS,RJ,SC,MG,MG,MG,MG"
col

'SP,RS,RJ,SC,MG,MG,MG,MG'

In [169]:
df["Estados"] = col
df

  index         W         X         Y         Z Estados
0     A  2.706850  0.628133  0.907969  0.503826      SP
1     B  0.651118 -0.319318 -0.848077  0.605965      RS
2     C -2.018168  0.740122  0.528813 -0.589001      RJ
3     D  0.188695 -0.758872 -0.933237  0.955057      SC
4     E  0.190794  1.978757  2.605967  0.683509      MG

In [173]:
df.drop('index',axis=1,inplace=True)

In [175]:
df.set_index("Estados")

                W         X         Y         Z
Estados
SP       2.706850  0.628133  0.907969  0.503826
RS       0.651118 -0.319318 -0.848077  0.605965
RJ      -2.018168  0.740122  0.528813 -0.589001
SC       0.188695 -0.758872 -0.933237  0.955057
MG       0.190794  1.978757  2.605967  0.683509

In [177]:
dict = {"empresa":["GOOG","GOOG","MSFT","MSFT","FB","FB"],"nome":["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],"venda":[100,200,500,180,120,110]}

In [180]:
dados = pd.DataFrame(dict)

In [188]:
group = dados.groupby("empresa")
group1 = dados.groupby("nome")

group1.sum()
group.sum()
group.describe()

        venda
        count   mean         std    min    25%    50%    75%    max
empresa
FB        2.0  115.0    7.071068  110.0  112.5  115.0  117.5  120.0
GOOG      2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  340.0  226.274170  180.0  260.0  340.0  420.0  500.0

In [208]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside  = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [209]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["a","b"])
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.975720 -0.388239
   2  0.783316 -0.708954
   3  0.586847 -1.621348
G2 1  0.677535  0.026105
   2 -1.678284  0.333973
   3 -0.532471  2.117727

In [211]:
df.index.names = ["grupo","numero"]

In [221]:
df.xs(["G1",1])

A    0.975720
B   -0.388239
Name: (G1, 1), dtype: float64

In [215]:
df.xs(1,level="numero")

              A         B
grupo
G1     0.975720 -0.388239
G2     0.677535  0.026105

In [222]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [225]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [229]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [231]:
df.fillna(value="ok")

    A   B  C
0   1   5  1
1   2  ok  2
2  ok  ok  3

In [233]:
df.fillna(df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [235]:
df.fillna(method="ffill")

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3